IBOCRWQUEST.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spi="http://spi.loans.app.fcr.iflex.com" xmlns:con="http://context.app.fcr.iflex.com" xmlns:dto="http://dto.spi.loans.app.fcr.iflex.com" xmlns:dto1="http://dto.global.app.fcr.iflex.com">
   <soapenv:Header/>
   <soapenv:Body>
      <spi:createLoanAccountForIBOC>
         <spi:sessionContext>
            <con:bankCode>?</con:bankCode>
            <con:channel>?</con:channel>
            <con:externalBatchNumber>?</con:externalBatchNumber>
            <con:externalReferenceNo>?</con:externalReferenceNo>
            <con:externalSystemAuditTrailNumber>?</con:externalSystemAuditTrailNumber>
            <con:localDateTimeText>?</con:localDateTimeText>
            <con:originalReferenceNo>?</con:originalReferenceNo>
            <con:overridenWarnings>?</con:overridenWarnings>
            <con:postingDateText>?</con:postingDateText>
            <con:reason>
               <con:comment>?</con:comment>
               <con:reasonCode>?</con:reasonCode>
            </con:reason>
            <con:serviceCode>?</con:serviceCode>
            <con:sessionTicket>?</con:sessionTicket>
            <con:supervisorContext>
               <con:primaryPassword>?</con:primaryPassword>
               <con:userId>?</con:userId>
            </con:supervisorContext>
            <con:transactionBranch>?</con:transactionBranch>
            <con:userId>?</con:userId>
            <con:userReferenceNumber>?</con:userReferenceNumber>
            <con:valueDateText>?</con:valueDateText>
         </spi:sessionContext>
         <spi:loanDirectAccountDetails>
            <dto:assetValue>?</dto:assetValue>
            <dto:branchCode>?</dto:branchCode>
            <dto:contribution>?</dto:contribution>
            <dto:customerId>?</dto:customerId>
            <dto:customerRelation>?</dto:customerRelation>
            <dto:interestRate>?</dto:interestRate>
            <dto:loanAmount>?</dto:loanAmount>
            <dto:loanPurpose>?</dto:loanPurpose>
            <dto:loanTerm>?</dto:loanTerm>
            <dto:productCode>?</dto:productCode>
            <dto:repaymentMode>?</dto:repaymentMode>
            <dto:scheduleCode>?</dto:scheduleCode>
         </spi:loanDirectAccountDetails>
        
         <spi:customerAndRelation>
            <dto1:customerId>?</dto1:customerId>
            <dto1:customerName>?</dto1:customerName>
            <dto1:relation>?</dto1:relation>
         </spi:customerAndRelation>
         <spi:flgRepaymentInstruction>?</spi:flgRepaymentInstruction>
        
         <spi:loanPaymentInstructions>
            <dto:arrearType>?</dto:arrearType>
            <dto:drawDownOnSalaryCredit>?</dto:drawDownOnSalaryCredit>
            <dto:percentageSalaryToBeDrawnDown>?</dto:percentageSalaryToBeDrawnDown>
            <dto:savingsAccountId>?</dto:savingsAccountId>
            <dto:transferFromSavings>?</dto:transferFromSavings>
         </spi:loanPaymentInstructions>
         <spi:employerCode>?</spi:employerCode>
      </spi:createLoanAccountForIBOC>
   </soapenv:Body>
</soapenv:Envelope>